import avatar from '../assets/images/avatar.png'
import logoName from '../assets/images/logo-name.png'


interface ISideBarItem {
    title: string
    id: number
    path: string
    value: string
    label: string
}

export interface IQuestions {
    id: number,
    url: string,
    desc: string,
    messages: 7,
    date: string,
    topic: string
    name: string
    uriName: string
}

export const sideBarItem: ISideBarItem[] = [
    {
        title: 'Все',
        id: 0,
        path: '',
        value: 'Все',
        label: 'Все'
    },
    {
        title: 'Визуал',
        id: 1,
        path: '',
        value: 'Визуал',
        label: 'Визуал'
    },
    {
        title: 'Насмотренность',
        id: 2,
        path: '',
        value: 'Насмотренность',
        label: 'Насмотренность'
    },
    {
        title: 'Проектирование',
        id: 3,
        path: '',
        value: 'Проектирование',
        label: 'Проектированиесе'
    },
    {
        title: 'Иконки',
        id: 4,
        path: '',
        value: 'Иконки',
        label: 'Иконки'
    },
    {
        title: 'Концепции',
        id: 5,
        path: '',
        value: 'Концепции',
        label: 'Концепции'
    },
    {
        title: 'Продуктовый подход',
        id: 6,
        path: '',
        value: 'Продуктовый подход',
        label: 'Продуктовый подход'
    },
    {
        title: 'Исследования',
        id: 7,
        path: '',
        value: 'Исследования',
        label: 'Исследования'
    },
    {
        title: 'Дизайн-инструменты',
        id: 8,
        path: '',
        value: 'Дизайн-инструменты',
        label: 'Дизайн-инструменты'
    },
    {
        title: 'Портфолио',
        id: 9,
        path: '',
        value: 'Портфолио',
        label: 'Портфолио'
    },
    {
        title: 'Коммуникация',
        id: 10,
        path: '',
        value: 'Коммуникация',
        label: 'Коммуникация'
    },
    {
        title: 'Управление',
        id: 11,
        path: '',
        value: 'Управление',
        label: 'Управление'
    },
    {
        title: 'Психология',
        id: 12,
        path: '',
        value: 'Психология',
        label: 'Психология'
    },
    {
        title: 'Управление временем',
        id: 13,
        path: '',
        value: 'Управление временем',
        label: 'Управление временем'
    },
    {
        title: 'Продажи',
        id: 14,
        path: '',
        value: 'Продажи',
        label: 'Продажи'
    },
    {
        title: 'Трудоустройство',
        id: 15,
        path: '',
        value: 'Трудоустройство',
        label: 'Трудоустройство'
    },
]

export const questions: IQuestions[] = [
    {
        id: 0,
        url: avatar,
        desc: 'У меня получился такой "мудборд" из парочки моих работ в сравнениис "рефами" - работами моей коллеги, с моими комментами. И подборка стилей иллюстрации, которые мне очень нравятся. Каким может быть задание для нашего двора нужен',
        messages: 7,
        date: '25 сент',
        topic: '#Проектирование',
        name: 'Алина Власова',
        uriName: logoName
    },
    {
        id: 1,
        url: avatar,
        desc: 'У меня получился такой "мудборд" из парочки моих работ в сравнениис "рефами" - работами моей коллеги, с моими комментами. И подборка стилей иллюстрации, которые мне очень нравятся. Каким может быть задание для',
        messages: 7,
        date: '25 сент',
        topic: '#Проектирование',
        name: 'Алина Власова',
        uriName: logoName
    },
    {
        id: 2,
        url: avatar,
        desc: 'У меня получился такой "мудборд" из парочки моих работ в сравнениис "рефами" - работами моей коллеги, с моими комментами. И подборка стилей иллюстрации, которые мне очень нравятся. Каким может быть задание для',
        messages: 7,
        date: '25 сент',
        topic: '#Проектирование',
        name: 'Алина Власова',
        uriName: logoName
    },
    {
        id: 3,
        url: avatar,
        desc: 'У меня получился такой "мудборд" из парочки моих работ в сравнениис "рефами" - работами моей коллеги, с моими комментами. И подборка стилей иллюстрации, которые мне очень нравятся. Каким может быть задание для',
        messages: 7,
        date: '25 сент',
        topic: '#Проектирование',
        name: 'Алина Власова',
        uriName: logoName
    },
    {
        id: 4,
        url: avatar,
        desc: 'У меня получился такой "мудборд" из парочки моих работ в сравнениис "рефами" - работами моей коллеги, с моими комментами. И подборка стилей иллюстрации, которые мне очень нравятся. Каким может быть задание для',
        messages: 7,
        date: '25 сент',
        topic: '#Проектирование',
        name: 'Алина Власова',
        uriName: logoName
    },
    {
        id: 5,
        url: avatar,
        desc: 'У меня получился такой "мудборд" из парочки моих работ в сравнениис "рефами" - работами моей коллеги, с моими комментами. И подборка стилей иллюстрации, которые мне очень нравятся. Каким может быть задание для',
        messages: 7,
        date: '25 сент',
        topic: '#Проектирование',
        name: 'Алина Власова',
        uriName: logoName
    },
    {
        id: 6,
        url: avatar,
        desc: 'У меня получился такой "мудборд" из парочки моих работ в сравнениис "рефами" - работами моей коллеги, с моими комментами. И подборка стилей иллюстрации, которые мне очень нравятся. Каким может быть задание для',
        messages: 7,
        date: '25 сент',
        topic: '#Проектирование',
        name: 'Алина Власова',
        uriName: logoName
    },
    {
        id: 7,
        url: avatar,
        desc: 'У меня получился такой "мудборд" из парочки моих работ в сравнениис "рефами" - работами моей коллеги, с моими комментами. И подборка стилей иллюстрации, которые мне очень нравятся. Каким может быть задание для',
        messages: 7,
        date: '25 сент',
        topic: '#Проектирование',
        name: 'Алина Власова',
        uriName: logoName
    },
    {
        id: 8,
        url: avatar,
        desc: 'У меня получился такой "мудборд" из парочки моих работ в сравнениис "рефами" - работами моей коллеги, с моими комментами. И подборка стилей иллюстрации, которые мне очень нравятся. Каким может быть задание для',
        messages: 7,
        date: '25 сент',
        topic: '#Проектирование',
        name: 'Алина Власова',
        uriName: logoName
    }
]